app/views/api/v1/search/index.json.jbuilder

SELECT "experts".* FROM "experts" WHERE (LOWER(alias) LIKE '%h%' OR LOWER(name) LIKE '%h%' OR LOWER(description) LIKE '%h%')
---
json.experts @experts.each do |expert|

SELECT "predictions".* FROM "predictions" WHERE (LOWER(alias) LIKE '%h%' OR LOWER(title) LIKE '%h%' OR LOWER(description) LIKE '%h%')
---

json.predictions @predictions.each do |prediction|

SELECT "claims".* FROM "claims" WHERE (LOWER(alias) LIKE '%h%' OR LOWER(title) LIKE '%h%' OR LOWER(description) LIKE '%h%')
---

json.claims @claims.each do |claim|