app/views/api/v1/predictions/index.json.jbuilder

SELECT "predictions".* FROM "predictions"
---
json.predictions @predictions.each do |prediction|