app/controllers/api/v1/claims_controller.rb

    def index
      # GET /CONTROLLER
      @claims = Claim.all
---
SELECT "claims".* FROM "claims"

    def create
      # POST /pundits
      @claim = Claim.new(claim_params)

      if @claim.save
        add_contribution(@claim, :created_claim)

        if params.has_key?(:expert_id)
          @expert = Expert.find(params[:expert_id])
          @expert.claims << @claim
          @claim.experts << @expert
---
INSERT INTO "claims" ("created_at", "updated_at", "title", "alias") VALUES (?, ?, ?, ?)  [["created_at", 2017-02-12 02:15:37 UTC], ["updated_at", 2017-02-12 02:15:37 UTC], ["title", "Thingggggg"], ["alias", "thingggggg"]]
SELECT  "experts".* FROM "experts" WHERE "experts"."id" = ? LIMIT ?  [["id", 30], ["LIMIT", 1]]
INSERT INTO "expert_claims" ("created_at", "updated_at", "expert_id", "claim_id") VALUES (?, ?, ?, ?)  [["created_at", 2017-02-12 02:15:55 UTC], ["updated_at", 2017-02-12 02:15:55 UTC], ["expert_id", 30], ["claim_id", 4]]
INSERT INTO "claim_experts" ("created_at", "updated_at", "claim_id", "expert_id") VALUES (?, ?, ?, ?)  [["created_at", 2017-02-12 02:15:55 UTC], ["updated_at", 2017-02-12 02:15:55 UTC], ["claim_id", 4], ["expert_id", 30]]