app/controllers/api/v1/evidences_controller.rb

INSERT INTO "evidences" ("created_at", "updated_at", "title", "url", "description", "image", "url_content", "domain") VALUES (?, ?, ?, ?, ?, ?, ?, ?)
SELECT  "predictions".* FROM "predictions" WHERE "predictions"."id" = ? LIMIT ?  [["id", 3], ["LIMIT", 1]]
SELECT  "claims".* FROM "claims" WHERE "claims"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
---
        def add_evidence
            return if params[:url].nil? or (params[:prediction_id].nil? and params[:claim_id].nil?)

            @page = MetaInspector.new(params[:url], :allow_non_html_content => true)
            evidence_params = {
                title: @page.best_title,
                domain: @page.host,
                description: @page.description,
                image: @page.images.best,
                url: params[:url],
                url_content: @page.hash,
            }

            if !params[:prediction_id].nil?
                @added = Prediction.find(params[:prediction_id]).evidences << @evidence = Evidence.create(evidence_params)
            else
                @added = Claim.find(params[:claim_id]).evidences << @evidence = Evidence.create(evidence_params)