app/controllers/api/v1/experts_controller.rb

SELECT "experts".* FROM "experts"
---
    def index
      # GET /CONTROLLER
      @experts = Expert.all

SELECT  "experts".* FROM "experts" WHERE "experts"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
SELECT  "experts".* FROM "experts" WHERE "experts"."alias" = ? ORDER BY "experts"."id" ASC LIMIT ?  [["alias", "might"], ["LIMIT", 1]]
---
    def show
      # GET /CONTROLLER/:id
      if params[:id] == 'search' && !params[:term].nil?
        return self.search
      end

      if params[:id].to_i != 0
        @expert = Expert.find_by_id(params[:id])
      else
        @expert = Expert.where(alias: params[:id]).first

INSERT INTO "experts" ("created_at", "updated_at", "name", "alias") VALUES (?, ?, ?, ?)  [["created_at", 2017-02-10 13:44:12 UTC], ["updated_at", 2017-02-10 13:44:12 UTC], ["name", "Bob!!"], ["alias", "bob"]]
SELECT  "predictions".* FROM "predictions" WHERE "predictions"."id" = ? LIMIT ?  [["id", 3], ["LIMIT", 1]]
INSERT INTO "prediction_experts" ("created_at", "updated_at", "prediction_id", "expert_id") VALUES (?, ?, ?, ?)  [["created_at", 2017-02-12 02:13:33 UTC], ["updated_at", 2017-02-12 02:13:33 UTC], ["prediction_id", 3], ["expert_id", 30]]
INSERT INTO "expert_predictions" ("created_at", "updated_at", "expert_id", "prediction_id") VALUES (?, ?, ?, ?)  [["created_at", 2017-02-12 02:13:33 UTC], ["updated_at", 2017-02-12 02:13:33 UTC], ["expert_id", 30], ["prediction_id", 3]]
SELECT  "claims".* FROM "claims" WHERE "claims"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
INSERT INTO "claim_experts" ("created_at", "updated_at", "claim_id", "expert_id") VALUES (?, ?, ?, ?)  [["created_at", 2017-02-12 02:05:17 UTC], ["updated_at", 2017-02-12 02:05:17 UTC], ["claim_id", 2], ["expert_id", 28]]
INSERT INTO "expert_claims" ("created_at", "updated_at", "expert_id", "claim_id") VALUES (?, ?, ?, ?)  [["created_at", 2017-02-12 02:07:42 UTC], ["updated_at", 2017-02-12 02:07:42 UTC], ["expert_id", 29], ["claim_id", 2]]
---
    def create
      # POST /pundits
      @expert = Expert.new(expert_params)

      if @expert.save
        add_contribution(@expert, :created_expert)

        if params.has_key?(:prediction_id)
          @prediction = Prediction.find(params[:prediction_id])
          @prediction.experts << @expert
          @expert.predictions << @prediction
        elsif params.has_key?(:claim_id)
          @claim = Claim.find(params[:claim_id])
          @claim.experts << @expert
          @expert.claims << @claim

DELETE FROM "experts" WHERE "experts"."id" = ?  [["id", 4]]
---
    def destroy
      # DELETE /pundits/:id
      if !has_permission_to_destroy
        render json: { result: "You don't have permission to destroy." }, status: 422
        return
      end

      if params.has_key?(:id)
        if @expert.destroy

SELECT  "experts".* FROM "experts" WHERE "experts"."id" = ? LIMIT ?  [["id", 3], ["LIMIT", 1]]
INSERT INTO "publications" ("created_at", "updated_at", "expert_id", "url", "title") VALUES (?, ?, ?, ?, ?)  [["created_at", 2017-02-12 02:36:55 UTC], ["updated_at", 2017-02-12 02:36:55 UTC], ["expert_id", 30], ["url", "http://www.news.com/"], ["title", "Cool Book"]]
---
    def add_publication
      # /experts/:expert_id/add_publication
      @expert = Expert.find_by_id(params[:expert_id])

      if @expert.nil?
        render json: { error: 'Expert Not Found' }, status: 422
        return
      end

      @publication = Publication.create(publication_params)

SELECT "experts".* FROM "experts" WHERE (LOWER(email) LIKE '%mighty%' OR LOWER(username) LIKE '%mighty%' OR LOWER(first_name) LIKE '%mighty%' OR LOWER(last_name) LIKE '%mighty%' OR LOWER(sign_up_user_agent_browser) LIKE '%mighty%' OR LOWER(sign_up_user_agent_platform) LIKE '%mighty%' OR LOWER(sign_up_method) LIKE '%mighty%')
---
    def set_expert
      @expert = Expert.find(params[:id])