app/controllers/api/v1/leaderboard_controller.rb

SELECT "claims".* FROM "claims" ORDER BY vote_value DESC
SELECT "claims".* FROM "claims" WHERE "claims"."status" = ? ORDER BY vote_value DESC  [["status", 0]]
---
        def claims
            @sort = "DESC"

            @status = params[:status] if params.has_key?(:status)
            @sort = params[:sort] if params.has_key?(:sort)

            @claims = Claim.order("vote_value #{@sort}")
            @claims = @claims.where(status: @status) if !@status.nil?

SELECT "claims".* FROM "claims" ORDER BY created_at DESC
---
        def newest_claims
            @status = nil
            @sort = "DESC"

            @status = params[:status] if params.has_key?(:status)
            @sort = params[:sort] if params.has_key?(:sort)

            @claims = Claim.order("created_at #{@sort}")

SELECT "claims".* FROM "claims" ORDER BY updated_at DESC
---
        def recently_updated_claims
            @status = nil
            @sort = "DESC"

            @status = params[:status] if params.has_key?(:status)
            @sort = params[:sort] if params.has_key?(:sort)

            @claims = Claim.order("updated_at #{@sort}")

SELECT "predictions".* FROM "predictions" WHERE "predictions"."status" IS NULL ORDER BY vote_value DESC
---
        def predictions
            @sort = "DESC"

            @status = params[:status] if params.has_key?(:status)
            @sort = params[:sort] if params.has_key?(:sort)

            @predictions = Prediction.order("vote_value #{@sort}")
            @predictions = @predictions.where(status: @status) if @status.nil?

SELECT "predictions".* FROM "predictions" ORDER BY created_at DESC
---
        def newest_predictions
            @sort = "DESC"

            @status = params[:status] if params.has_key?(:status)
            @sort = params[:sort] if params.has_key?(:sort)

            @predictions = Prediction.order("created_at #{@sort}")

SELECT "predictions".* FROM "predictions" ORDER BY created_at DESC
---
        def recently_updated_predictions
            @sort = "DESC"

            @status = params[:status] if params.has_key?(:status)
            @sort = params[:sort] if params.has_key?(:sort)

            @predictions = Prediction.order("created_at #{@sort}")

SELECT "experts".* FROM "experts" ORDER BY accuracy DESC
---
        def experts
            @sort = "DESC"

            @sort = params[:sort] if params.has_key?(:sort)

            @experts = Expert.order("accuracy #{@sort}")

SELECT "experts".* FROM "experts" ORDER BY created_at DESC
---
        def newest_experts
            @sort = "DESC"

            @sort = params[:sort] if params.has_key?(:sort)

            @experts = Expert.order("created_at #{@sort}")

SELECT "experts".* FROM "experts" ORDER BY updated_at DESC
---
        def recently_updated_experts
            @sort = "DESC"

            @status = params[:status] if params.has_key?(:status)
            @sort = params[:sort] if params.has_key?(:sort)

            @experts = Expert.order("updated_at #{@sort}")