app/controllers/api/v1/predictions_controller.rb

SELECT "predictions".* FROM "predictions"
---
    def index
      # GET /CONTROLLER
      @predictions = Prediction.all

INSERT INTO "predictions" ("created_at", "updated_at", "title", "alias") VALUES (?, ?, ?, ?)  [["created_at", 2017-02-12 02:14:32 UTC], ["updated_at", 2017-02-12 02:14:32 UTC], ["title", "Le bob"], ["alias", "le-bob"]]
SELECT  "experts".* FROM "experts" WHERE "experts"."id" = ? LIMIT ?  [["id", 30], ["LIMIT", 1]]
INSERT INTO "expert_predictions" ("created_at", "updated_at", "expert_id", "prediction_id") VALUES (?, ?, ?, ?)  [["created_at", 2017-02-12 02:14:32 UTC], ["updated_at", 2017-02-12 02:14:32 UTC], ["expert_id", 30], ["prediction_id", 4]]
INSERT INTO "prediction_experts" ("created_at", "updated_at", "prediction_id", "expert_id") VALUES (?, ?, ?, ?)  [["created_at", 2017-02-12 02:14:32 UTC], ["updated_at", 2017-02-12 02:14:32 UTC], ["prediction_id", 4], ["expert_id", 30]]
---
    def create
      # POST /pundits
      @prediction = Prediction.new(prediction_params)

      if @prediction.save
        add_contribution(@prediction, :created_prediction)

        if params.has_key?(:expert_id)
          @expert = Expert.find(params[:expert_id])
          @expert.predictions << @prediction
          @prediction.experts << @expert