app/controllers/api/v1/search_controller.rb

        def index
            if !params.has_key?(:query)
                render json: { error: "Search Query Required" }, status: 422
                return
            end

            @claims = Claim.search(params[:query])
            @experts = Expert.search(params[:query])
            @predictions = Prediction.search(params[:query])


            # record search history
            @search = Search.new
            @search.query = params[:query]
            @search.user = current_user if !current_user.nil?
            @search.save
---
SELECT "claims".* FROM "claims" WHERE (LOWER(alias) LIKE '%h%' OR LOWER(title) LIKE '%h%' OR LOWER(description) LIKE '%h%')
SELECT "experts".* FROM "experts" WHERE (LOWER(alias) LIKE '%h%' OR LOWER(name) LIKE '%h%' OR LOWER(description) LIKE '%h%')
SELECT "predictions".* FROM "predictions" WHERE (LOWER(alias) LIKE '%h%' OR LOWER(title) LIKE '%h%' OR LOWER(description) LIKE '%h%')
INSERT INTO "searches" ("query", "created_at", "updated_at") VALUES (?, ?, ?)  [["query", "h"], ["created_at", 2017-02-14 14:12:37 UTC], ["updated_at", 2017-02-14 14:12:37 UTC]]