app/views/api/v1/claims/index.json.jbuilder

SELECT "claims".* FROM "claims"
---
json.claims @claims.each do |claim|