app/views/api/v1/experts/index.json.jbuilder

json.experts @experts.each do |expert|
---
SELECT "experts".* FROM "experts"