app/views/api/v1/experts/show.json.jbuilder


  json.category_accuracies @expert.expert_category_accuracies.each do |eca|
---
SELECT "experts".* FROM "experts" WHERE (LOWER(email) LIKE '%mighty%' OR LOWER(username) LIKE '%mighty%' OR LOWER(first_name) LIKE '%mighty%' OR LOWER(last_name) LIKE '%mighty%' OR LOWER(sign_up_user_agent_browser) LIKE '%mighty%' OR LOWER(sign_up_user_agent_platform) LIKE '%mighty%' OR LOWER(sign_up_method) LIKE '%mighty%')