app/controllers/authentication_controller.rb

  def authenticate_user
    user = User.find_for_database_authentication(email: params[:email])
---
SELECT  "users".* FROM "users" WHERE "users"."email" = ? ORDER BY "users"."id" ASC LIMIT ?  [["email", "brian@hoggworks.com"], ["LIMIT", 1]]